{
  "peft_type": "LORA",
  "task_type": "CAUSAL_LM",
  "target_modules": ["q_proj", "v_proj", "k_proj", "o_proj"],
  "r": 8,
  "lora_alpha": 16,
  "lora_dropout": 0.05,
  "bias": "none",
  "inference_mode": false,
  "base_model_name_or_path": "Qwen/Qwen2.5-Coder-7B-Instruct"
}